{
    "searchResults": [
    {
    "name": "Recipes",
    "type": "products",
    "totalResults": 54,
    "totalResultsVariants": 54,
    "results": [
    {
    "id": 642539,
    "name": "Falafel Burger",
    "image": "https://spoonacular.com/recipeImages/642539-312x231.png",
    "link": "https://spoonacular.com/recipes/falafel-burger-642539",
    "type": "HTML",
    "relevance": 10000,
    "content": "You can never have too many middl eastern recipes, so give Falafel Burger a try. For <b>$1.37 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains around <b>12g of protein</b>, <b>20g of fat</b>, and a total of <b>402 calories</b>. This recipe serves 4. It is brought to you by Foodista. 4 people were impressed by this recipe. Head to the store and pick up onion, garlic, sriracha sauce, and a few other things to make it today. Only a few people really liked this main course. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. It is a good option if you're following a <b>dairy free and lacto ovo vegetarian</b> diet. With a spoonacular <b>score of 81%</b>, this dish is spectacular. Try <a href=\"https://spoonacular.com/recipes/clean-eating-falafel-burger-1063020\">Clean eating falafel burger</a>, <a href=\"https://spoonacular.com/recipes/clean-eating-falafel-burger-848720\">Clean eating falafel burger</a>, and <a href=\"https://spoonacular.com/recipes/falafel-veggie-burger-with-feta-yogurt-sauce-559036\">Falafel Veggie Burger with Feta Yogurt Sauce</a> for similar recipes.",
    "dataPoints": []
    },
    {
    "id": 631814,
    "name": "$50,000 Burger",
    "image": "https://spoonacular.com/recipeImages/631814-312x231.jpg",
    "link": "https://spoonacular.com/recipes/-50-000-burger-631814",
    "type": "HTML",
    "relevance": 9999,
    "content": "The recipe $50,000 Burger could satisfy your American craving in around <b>45 minutes</b>. One serving contains <b>1499 calories</b>, <b>114g of protein</b>, and <b>97g of fat</b>. This recipe serves 4 and costs $7.9 per serving. Only a few people really liked this main course. 1 person has made this recipe and would make it again. A mixture of onion, salt, to assemble the burgers, and a handful of other ingredients are all it takes to make this recipe so tasty. To use up the walnuts you could follow this main course with the <a href=\"https://spoonacular.com/recipes/pistachio-cake-with-walnuts-426558\">Pistachio Cake with Walnuts</a> as a dessert. It is a good option if you're following a <b>dairy free</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 59%</b>. This score is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/burger-club-award-winning-logan-county-burger-patty-melt-477749\">Burger Club: Award-Winning Logan County Burger Patty Melt</a>, <a href=\"https://spoonacular.com/recipes/new-york-burger-week-pretzel-burger-with-beer-cheese-493632\">New York Burger Week: Pretzel Burger with Beer Cheese</a>, and <a href=\"https://spoonacular.com/recipes/beef-burger-recipe-elvis-burger-with-salad-gherkin-23359\">Beef Burger Recipe (elvis Burger With Salad & Gherkin)</a>.",
    "dataPoints": []
    },
    {
    "id": 663050,
    "name": "Tex-Mex Burger",
    "image": "https://spoonacular.com/recipeImages/663050-312x231.jpg",
    "link": "https://spoonacular.com/recipes/tex-mex-burger-663050",
    "type": "HTML",
    "relevance": 9998,
    "content": "Tex-Mex Burger might be just the main course you are searching for. For <b>$3.51 per serving</b>, this recipe <b>covers 36%</b> of your daily requirements of vitamins and minerals. One serving contains <b>910 calories</b>, <b>52g of protein</b>, and <b>63g of fat</b>. Only a few people made this recipe, and 1 would say it hit the spot. This recipe is typical of American cuisine. Head to the store and pick up onion, ground beef, cumin, and a few other things to make it today. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. From preparation to the plate, this recipe takes roughly <b>15 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 75%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/tex-mex-burgers-912878\">Tex-Mex Burgers</a>, <a href=\"https://spoonacular.com/recipes/tex-mex-chopped-chicken-salad-912384\">Tex-Mex Chopped Chicken Salad</a>, and <a href=\"https://spoonacular.com/recipes/creamy-tex-mex-pasta-salad-926252\">Creamy Tex-Mex Pasta Salad</a> for similar recipes.",
    "dataPoints": []
    },
    {
    "id": 622825,
    "name": "Tortilla Burger Loco Vaca",
    "image": "https://spoonacular.com/recipeImages/622825-312x231.jpg",
    "link": "https://spoonacular.com/recipes/tortilla-burger-loco-vaca-622825",
    "type": "HTML",
    "relevance": 9997,
    "content": "Tortilla Burger Loco Vaca might be just the main course you are searching for. One serving contains <b>1136 calories</b>, <b>54g of protein</b>, and <b>86g of fat</b>. This recipe serves 2 and costs $3.71 per serving. From preparation to the plate, this recipe takes approximately <b>40 minutes</b>. If you have avocado, bacon, cheddar cheese, and a few other ingredients on hand, you can make it. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. This recipe is typical of American cuisine. Similar recipes include <a href=\"https://spoonacular.com/recipes/loco-for-moco-blend-and-extend-loco-moco-623455\">Loco for Moco: Blend and Extend Loco Moco</a>, <a href=\"https://spoonacular.com/recipes/vaca-frita-crispy-beef-81504\">Vaca Frita: Crispy Beef</a>, and <a href=\"https://spoonacular.com/recipes/loco-moco-494434\">Loco Moco</a>.",
    "dataPoints": []
    },
    {
    "id": 663357,
    "name": "The Unagi Burger",
    "image": "https://spoonacular.com/recipeImages/663357-312x231.jpg",
    "link": "https://spoonacular.com/recipes/the-unagi-burger-663357",
    "type": "HTML",
    "relevance": 9996,
    "content": "The Unagi Burger is a main course that serves 4. One portion of this dish contains about <b>52g of protein</b>, <b>60g of fat</b>, and a total of <b>932 calories</b>. For <b>$2.96 per serving</b>, this recipe <b>covers 34%</b> of your daily requirements of vitamins and minerals. 1 person has made this recipe and would make it again. If you have broccoli sprouts, salt, ginger, and a few other ingredients on hand, you can make it. Only a few people really liked this American dish. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. It is a good option if you're following a <b>dairy free</b> diet. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 64%</b>, which is good. Similar recipes are <a href=\"https://spoonacular.com/recipes/unagi-chazuke-540743\">Unagi Chazuke</a>, <a href=\"https://spoonacular.com/recipes/eggplant-unagi-donburi-540727\">Eggplant & Unagi Donburi</a>, and <a href=\"https://spoonacular.com/recipes/unagi-kamameshi-iron-pot-rice-with-eel-2782\">Unagi Kamameshi (iron Pot Rice With Eel)</a>.",
    "dataPoints": []
    },
    {
    "id": 651190,
    "name": "Masala-Tofu Burger",
    "image": "https://spoonacular.com/recipeImages/651190-312x231.jpg",
    "link": "https://spoonacular.com/recipes/masala-tofu-burger-651190",
    "type": "HTML",
    "relevance": 9995,
    "content": "Masala-Tofu Burger could be just the <b>dairy free</b> recipe you've been looking for. This recipe serves 4 and costs $3.61 per serving. This main course has <b>486 calories</b>, <b>19g of protein</b>, and <b>11g of fat</b> per serving. A mixture of tofu - shopping list, cumin powder shopping list, hing shopping list, and a handful of other ingredients are all it takes to make this recipe so delicious. 2 people were glad they tried this recipe. This recipe is typical of American cuisine. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns an <b>amazing spoonacular score of 87%</b>. Try <a href=\"https://spoonacular.com/recipes/veggie-masala-burger-patty-33366\">Veggie Masala Burger Patty</a>, <a href=\"https://spoonacular.com/recipes/tofu-tikka-masala-248839\">Tofu Tikka Masala</a>, and <a href=\"https://spoonacular.com/recipes/masala-spiced-tofu-scramble-627325\">Masala Spiced Tofu Scramble</a> for similar recipes.",
    "dataPoints": []
    },
    {
    "id": 663252,
    "name": "The Blarney Burger",
    "image": "https://spoonacular.com/recipeImages/663252-312x231.jpg",
    "link": "https://spoonacular.com/recipes/the-blarney-burger-663252",
    "type": "HTML",
    "relevance": 9994,
    "content": "Forget going out to eat or ordering takeout every time you crave American food. Try making The Blarney Burger at home. This recipe makes 4 servings with <b>777 calories</b>, <b>52g of protein</b>, and <b>46g of fat</b> each. For <b>$5.46 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista requires ground sirloin, piccante gorgonzola crumbles, pepper, and worchester. 2 people have made this recipe and would make it again. It works well as a pricey main course. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 61%</b>. This score is pretty good. Similar recipes are <a href=\"https://spoonacular.com/recipes/blarney-stone-204867\">Blarney Stone</a>, <a href=\"https://spoonacular.com/recipes/blarney-stones-445810\">Blarney Stones</a>, and <a href=\"https://spoonacular.com/recipes/blarney-balls-530965\">Blarney Balls</a>.",
    "dataPoints": []
    },
    {
    "id": 650181,
    "name": "Little Italy Burger",
    "image": "https://spoonacular.com/recipeImages/650181-312x231.jpg",
    "link": "https://spoonacular.com/recipes/little-italy-burger-650181",
    "type": "HTML",
    "relevance": 9993,
    "content": "Little Italy Burger might be just the <b>American</b> recipe you are searching for. This recipe makes 4 servings with <b>961 calories</b>, <b>43g of protein</b>, and <b>71g of fat</b> each. For <b>$4.61 per serving</b>, this recipe <b>covers 22%</b> of your daily requirements of vitamins and minerals. Head to the store and pick up ground beef, butter, onion, and a few other things to make it today. 1 person has made this recipe and would make it again. It is brought to you by Foodista. It works best as a main course, and is done in around <b>around 45 minutes</b>. With a spoonacular <b>score of 44%</b>, this dish is solid. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/florentines-italy-741718\">Florentines (Italy)</a>, <a href=\"https://spoonacular.com/recipes/little-italy-pignoli-cookies-462407\">Little Italy Pignoli Cookies</a>, and <a href=\"https://spoonacular.com/recipes/little-italy-homemade-pizza-612358\">Little Italy Homemade Pizza</a>.",
    "dataPoints": []
    },
    {
    "id": 663209,
    "name": "The Benedict Burger",
    "image": "https://spoonacular.com/recipeImages/663209-312x231.jpg",
    "link": "https://spoonacular.com/recipes/the-benedict-burger-663209",
    "type": "HTML",
    "relevance": 9992,
    "content": "The recipe The Benedict Burger is ready <b>in approximately 45 minutes</b> and is definitely an outstanding <b>gluten free</b> option for lovers of American food. This recipe serves 6 and costs $1.16 per serving. One serving contains <b>422 calories</b>, <b>15g of protein</b>, and <b>39g of fat</b>. 1 person has tried and liked this recipe. A mixture of pepper& salt, lemon juice, egg yolks, and a handful of other ingredients are all it takes to make this recipe so delicious. To use up the oatmeal you could follow this main course with the <a href=\"https://spoonacular.com/recipes/7-layer-oatmeal-chocolate-chip-cookie-bars-549652\">7 Layer Oatmeal Chocolate Chip Cookie Bars</a> as a dessert. It works well as a budget friendly main course. All things considered, we decided this recipe <b>deserves a spoonacular score of 28%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/burger-club-award-winning-logan-county-burger-patty-melt-477749\">Burger Club: Award-Winning Logan County Burger Patty Melt</a>, <a href=\"https://spoonacular.com/recipes/beef-burger-recipe-elvis-burger-with-salad-gherkin-23359\">Beef Burger Recipe (elvis Burger With Salad & Gherkin)</a>, and <a href=\"https://spoonacular.com/recipes/new-york-burger-week-pretzel-burger-with-beer-cheese-493632\">New York Burger Week: Pretzel Burger with Beer Cheese</a> for similar recipes.",
    "dataPoints": []
    },
    {
    "id": 637631,
    "name": "Cheesy Bacon Burger with Spicy Chipotle Aiolo Sauce",
    "image": "https://spoonacular.com/recipeImages/637631-312x231.jpg",
    "link": "https://spoonacular.com/recipes/cheesy-bacon-burger-with-spicy-chipotle-aiolo-sauce-637631",
    "type": "HTML",
    "relevance": 9991,
    "content": "You can never have too many main course recipes, so give Cheesy Bacon Burger with Spicy Chipotle Aiolo Sauce a try. For <b>$3.16 per serving</b>, this recipe <b>covers 31%</b> of your daily requirements of vitamins and minerals. This recipe makes 4 servings with <b>494 calories</b>, <b>51g of protein</b>, and <b>20g of fat</b> each. A mixture of chipotle chiles in adobo, mayonnaise, garlic, and a handful of other ingredients are all it takes to make this recipe so scrumptious. To use up the ground cumin you could follow this main course with the <a href=\"https://spoonacular.com/recipes/moroccan-chocolate-mousse-752536\">Moroccan Chocolate Mousse</a> as a dessert. A few people made this recipe, and 17 would say it hit the spot. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 87%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/cheesy-bacon-oven-chips-with-chipotle-ranch-dipping-sauce-590236\">Cheesy Bacon Oven Chips with Chipotle Ranch Dipping Sauce</a>, <a href=\"https://spoonacular.com/recipes/chipotle-bacon-turkey-burger-84500\">Chipotle-Bacon Turkey Burger</a>, and <a href=\"https://spoonacular.com/recipes/cheesy-bacon-burger-pizza-421444\">Cheesy Bacon Burger Pizza</a> for similar recipes.",
    "dataPoints": []
    }
    ]
    }
]
}